app/services/system_check.rb

SELECT "settings".* FROM "settings" ORDER BY "settings"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def run_reactor_test
    puts "🔬 NUCLEAR REACTOR SYSTEM CHECK"
    puts "=" * 50
    puts "Timestamp: #{Time.current}"
    puts

    setting = Setting.first