app/models/setting.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def log_changes
    return unless saved_changes.any?

    log_entry = {
      timestamp: Time.current,
      user: User.find(updated_by).name,
      user_role: User.find(updated_by).role,
      changes: saved_changes.except('updated_at', 'created_at')