app/models/setting.rb

  def self.create_reactor_setting(user, attributes = {})
    unless user.is_a?(User)
      raise ArgumentError, "First parameter must be a User object"
    end

    setting = new(attributes.merge(updated_by: user.id))

    if setting.save
---
INSERT INTO "settings" ("max_power", "min_power", "temperature", "status", "updated_by", "created_at", "updated_at", "last_maintenance_date", "maintenance_temperature_offset") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update_reactor_setting(user, attributes = {})
    unless user.is_a?(User)
      raise ArgumentError, "First parameter must be a User object"
    end

    # Check if engineer is trying to update reactor in critical state
    if status == 'critical' && user.engineer?
      return nil
    end

    self.updated_by = user.id
---
UPDATE "settings" SET "status" = ?, "updated_by" = ?, "updated_at" = ?, "last_maintenance_date" = ?, "maintenance_temperature_offset" = ? WHERE "settings"."id" = ?  [["status", "maintenance"], ["updated_by", 3], ["updated_at", "2026-05-01 09:57:18.177219"], ["last_maintenance_date", "2026-05-01"], ["maintenance_temperature_offset", 0], ["id", 1]]

        authorization_code: auth_result[:code] || "none"
      }

      log_file_path = Rails.root.join('log', 'reactor_settings.log')
---
SELECT "settings".* FROM "settings" ORDER BY "settings"."id" ASC LIMIT ?  [["LIMIT", 1]]

      authorization_code: auth_result[:code]
    }

    log_file_path = Rails.root.join('log', 'reactor_settings.log')
---
SELECT "settings".* FROM "settings" ORDER BY "settings"."id" ASC LIMIT ?  [["LIMIT", 1]]