app/models/user.rb

  def update_current_setting(attributes = {})
    current_setting = Setting.first
---
SELECT "settings".* FROM "settings" ORDER BY "settings"."id" ASC LIMIT ?  [["LIMIT", 1]]